Revit 2024 API
StructuralSectionConcreteCross Class
 Defines parameters for parameterized concrete cross structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionConcreteCross : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionConcreteCross _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionConcreteCross : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross
See Also
StructuralSectionConcreteCross Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace